# GetValidFamiliesForNoteBlock Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..GetValidFamiliesForNoteBlock Method
ViewSchedule Class See Also
---
Gets a list of families that can be used for a note block.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static ICollection<ElementId> GetValidFamiliesForNoteBlock(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetValidFamiliesForNoteBlock ( _
	document As Document _
) As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
static ICollection<ElementId^>^ GetValidFamiliesForNoteBlock(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The IDs of all valid families.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace